Repository: LibrIT/passhport
Catalog: docs/po/*/LC_MESSAGES/installation-and-configuration/installation-on-centos.po
Languages: fr

source: Installation on CentOS 7
fr: Installation sur CentOS 7

source: The followings shows you how to install and run PaSSHport on CentOS 7. We start from a minimal installation of CentOS (available `here <https://www.centos.org/download/>`__).
fr: Les paragraphes suivant expliquent comment installer et faire tourner PaSSHport sur CentOS 7. On part d'une installation de minimal de CentOS 7 (disponible `ici <https://www.centos.org/download/>`__).

source: The easy, automated way
fr: La manière simple, et automatisée

source: You can review the installation script `here <https://raw.githubusercontent.com/Raphux/passhport/master/tools/passhport-install-script-centos7.sh>`__.
fr: Le script d'installation est disponible pour relecture `ici <https://raw.githubusercontent.com/Raphux/passhport/master/tools/passhport-install-script-centos7.sh>`__.

source: You can run it directly from command line :
fr: Vous pouvez le lancer directement depuis la ligne de commande :

source: Once finished, you can go to the `Getting Started <getting-started.html>`_ chapter.
fr: Une fois l'installation terminée, rendez-vous au chapitre `Première configuration <getting-started.html>`_.

source: The long, manual way
fr: La manière longue, manuelle

source: To understand what you do on your system when you install PaSSHport, follow the instructions below, that are more or less the step by step commands from the automated installation script.
fr: Si vous voulez comprendre ce qui se passe sur votre système, quand vous installez PaSSHport, suivez les instruction suivantes, qui sont (grossièrement) les commandes, une à une, du script d'installation automatisé sus-mentionné.

source: Install the EPEL repository :
fr: On installe le dépot EPEL :

source: Install python34-pip and other packages that we’ll need later for this tutorial (it will get ~100MB from the archives, so be patient) :
fr: On installe python34-pip, et d'autre packages dont nous aurons besoin plus tard pour ce tuto (il y a environ 100Mo à récupérer sur les dépôts, donc soyez patient) :

source: Let’s update pip :
fr: On mets à jour pip :

source: Now, install virtual-env using pip :
fr: On installe virtual-env, en utilisant pip :

source: Next we will need to add a system user called « passhport », and switch to it :
fr: Ensuite, nous aurons besoin d'ajouter un utilisateur appelé « passhport », et exécuter quelques commande en tant que lui :

source: We now need to create a virtual-env for passhport user :
fr: On crée un environnement «virtuel-env» pour cette utilisateur passhport :

source: Now that we have our virtual-env, we install the python’s modules we’ll need for PaSSHport :
fr: Maintenant que nous avons notre «virtual-env», on installe les modules python nécessaires au fonctionnement de PaSSHport :

source: Now, let’s start the real thing…
fr: Commençons les choses sérieuses…

source: Let’s get passhport sources from github :
fr: On récupère les sources de PaSSHport sur github :

source: PaSSHport will need to write some logs, so, as root, we’ll create a directory in « /var/log », and give the ownership to the « passhport » user:
fr: PaSSHport a besoin d'écrire des logs, il faut donc créer un répertoire dans «/var/log», et en attribuer la propriété à l'utilisateur «passhport» :

source: We’ll also create the config directory, and copy the differents config file :
fr: On crée aussi le répertoire qui contiendra la configuration, et on copie les différents fichiers de configuration dedans :

source: We’ll also need to make some modifications in those config file, if you run passhportd on a distant server. Here we’ll change the default listening address (localhost) to the real IP of our server.
fr: Nous devons faire quelques modifications dans ces fichiers de configurations, surtout si on souhaite séparer les composants sur différentes machines. On remplace ici l'adresse d'écoute par défaut (localhost), avec la *vrai* IP du serveur.

source: First, passhportd :
fr: D'abord passhportd :

source: Change the « LISTENING_IP » parameter, to the IP address of your server :
fr: On change la directive « LISTENING_IP », par l'adresse IP du serveur :

source: Change the following parameter in /etc/passhport/passhport.ini and /etc/passhport/passhport-admin.ini :
fr: On change le paramètre suivante dans /etc/passhport/passhport.ini et /etc/passhport/passhport-admin.ini :

source: We’ll need ssh publickey, so we generate an 4096 bits RSA key:
fr: Nous aurons besoin d'une clef SSH. On en génère donc une RSA de 4096 bits :

source: This will be the key that’ll be use by PaSSHport to connect to your hosts. You can also generate a ECDSA key if you wish :
fr: Cette clé sera utilisé par passhport pour se connecter aux différents serveurs. On peut aussi générer une clef ECDSA si on veut :

source: Again as root, let’s make the directory that’ll contains the database (because we use SQLite for this tutorial) :
fr: Une fois encore en tant que root, on crée le répertoire qui contiendra la base de données (parce qu'on utilise SQLite pour ce tuto) :

source: … then we’ll have to change 3 paramaters in the passhportd config file (as root, edit «/etc/passhport/passhportd.ini») :
fr: … on a alors 3 paramètres à changer dans le fichier de conf de passhportd (en tant que root, on édite «/etc/passhport/passhportd.ini») :

source: Now we can create the database and check that it has correcly been created:
fr: On peut maintenant créer la base de données, et vérifier que celle-ci a été correctement créé :

source: We’ll now need to create the certificate to secure the API. First, create the directory in which will be key and the cert, and make the directory rwx for passport only :
fr: On va maintenant créer un certificat pour sécuriser les échanges avec l'API. D'abord, on crée le répertoire dans lequel se trouveront la clé privée et le certificat. Il faut aussi attribué les droits rwx à l'utilisateur «passhport» seulement :

source: Create the RSA key :
fr: On crée la clé RSA :

source: There is a conf file provided for OpenSSL, to generate a minimal correct SSL cert. The file is :
fr: Il y a un fichier de configuration pour OpenSSL fourni avec les sources de PaSSHport, pour générer un certificat minimal SSL correcte. Le fichier est :

source: Edit it, and add DNS name you’ll use to reach the API. For the tutorial, we’ll use two hostnames (localhost added) :
fr: On l'édite, et on ajoute de nom DNS dont on se servira pour joindre l'API. Pour ce tuto, on utilisera deux noms d'hôtes :

source: Now, generate the certificate using this command (put on multiple lines, so you can copy/paste easily), but please adapt the subject line (-subj) :
fr: On génère le certificat avec la commande suivante (on peut faire un copié/collé des lignes suivantes). Par contre, il faut bien entendu adapter la ligne du sujet (-subj) à votre installation :

source: Once executed, you’ll have a cert file next to the key file :
fr: Une fois exécuté, vous aurez un certificat à côté d'une clé :

source: As root, create some symlink to the two main *binaries*, passhportd and passhport-admin, so you can access it without typing full path :
fr: En tant que root, on crée deux liens symboliques vers les deux principaux, passhportd et passhport-admin, pour ne plus avoir à besoin :

source: We now create the systemd service, and enables *passhportd* on startup :
fr: On peut créer un service systemd, et activer *passhportd* au démarrage :

source: And now, we’re ready to go, just launch passhportd daemon :
fr: Il n'y a plus qu'à démarrer le démon passhportd :

source: You can check that passhportd is running, by curling the IP you previously configured in */etc/passhport/passhportd.ini*, on port 5000 :
fr: On peut maintenant vérifier que passhportd tourne correctement, en "curlant" l'IP qu'on a précédemment configurée dans */etc/passhport/passhportd.ini*, sur le port 5000 :

source: Bravo ! You successfully installed PaSSHport. You may now go to the `Getting Started <getting-started.html>`_ chapter.
fr: Well done ! Vous avez installé PaSSHport. Vous pouvez maintenant lire le chapitre `Première utilisation <getting-started.html>`_.
